#+title: Bad OO Acoustics simulation toolbox (booast)
#+author: Johann-Markus Batke
#+date: 2018-03-14
#+setupfile: booast.setup
#+exclude_tags: internal

*** Tests                                                          :internal:
Let us test for the vector. The snippet
#+name: vectortest 
#+BEGIN_SRC octave 
  x = 1; y = 2; z = 3; 
  S_type = 'cartesian';
  v = vector(x, y, z, S_type);
#+END_SRC
is used in tests below.

E.g., is this an object?
#+name: vectortest object test
#+BEGIN_SRC octave :tangle vector_object_test.m 
<<vectortest>>
ans = isobject(v);
#+END_SRC

#+RESULTS: vectortest object test
: 1

It is, if 1. How nice.

*** Examples

- four parameter input :: single values for each dimension
  #+name: vectortest four param test
  #+BEGIN_SRC octave :results output
    x = 1; y = 2; z = 3; S_type = 'cartesian';
    v = vector(x, y, z, S_type);
    isavector = isa(v, 'vector')
  #+END_SRC

  #+RESULTS: vectortest four param test
  : isavector = 1

- two parameters imput :: vector positions in a matrix
     
  #+name: vectortest two param test
  #+BEGIN_SRC octave :tangle vector_matrix_input_test.m
    x = [1; 2; 3]; S_type = 'cartesian';
    v = vector(x, S_type);
    ans = isobject(v);
  #+END_SRC

  #+RESULTS: vectortest two param test
  : 1

  As long the first dimension is 3, we can input matrices of any dimension.
  #+name: vectortest multidim param test
  #+BEGIN_SRC octave
    x = rand(3, 4, 6, 7); S_type = 'cartesian';
    v = vector(x, S_type);
    ans = size(v);
  #+END_SRC

  #+RESULTS: vectortest multidim param test
  | 4 | 6 | 7 |

- one parameter input :: we use vectorgrid as input type
  #+name: vectortest vectorgrid param test
  #+BEGIN_SRC octave 
    x = linspace(0,10, 10); y = x; z = x; S_type = 'cartesian';
    g = vectorgrid(x, y, z, S_type);
    v = vector(g);
    ans = size(v);
  #+END_SRC

  #+RESULTS: vectortest vectorgrid param test
  | 10 | 10 | 10 |

**** Example
 #+BEGIN_SRC octave :results output :exports both
 <<vectortest>>
 display(v)
 #+END_SRC

 #+RESULTS:
 : v = 1.000000 2.000000 3.000000 

**** Tests                                                         :internal:
 Test this with the test case above
 #+BEGIN_SRC octave :results output :tangle tmp.m 
 <<vectortest>>
 ismethod(v, 'size')
 size(v)
 #+END_SRC

 #+RESULTS:
 : ans =  1
 : ans =
 : 
 :    1   1
 : 

**** Examples
 If arrays are in use:
 #+BEGIN_SRC octave :results output :exports both
   x = linspace(0,9, 9); y = x; z = x; S_type = 'cartesian';
   g_XYZ = vectorgrid(x, y, z, S_type);
   v_XYZ = vector(g_XYZ);
   numel(v_XYZ)
   size(v_XYZ)
   numel(g_XYZ)
   size(g_XYZ)
 #+END_SRC

 #+RESULTS:
 #+begin_example
 ans =  729
 ans =

    9   9   9

 ans =  1
 ans =

    9   9   9

 #+end_example

**** Tests                                                         :internal:
 #+name: vectortest numel test
 #+BEGIN_SRC octave 
 <<vectortest>>
 ans = numel(v);
 #+END_SRC

 #+RESULTS: vectortest numel test
 : 1

***** 3D
 #+name: tectortest get test
 #+BEGIN_SRC octave 
 <<vectortest>>
 ans = get(v, 'spherical');
 #+END_SRC

 #+RESULTS: tectortest get test
 |  3.741657386773941 |
 | 0.6405223126794245 |
 |   1.10714871779409 |

 ...so, this is the content used in the /vectortest/ defined.

**** Examples
     :PROPERTIES:
     :header-args: :exports both
     :END:
 Known points on a sphere are easier to recognise, so let us test this
 (including some coordinate transformation):
 #+name: vector northpole test
 #+BEGIN_SRC octave
   v = vector([0, 0, 1]', 'cartesian');
   get(v, 'spherical')
 #+END_SRC

 #+RESULTS: vector northpole test
 | 1 |
 | 0 |
 | 0 |

 ...or take the south pole
 #+name: vector southpole
 #+BEGIN_SRC octave
   v = vector([0, 0, -1]', 'cartesian');
   get(v, 'spherical')
 #+END_SRC

 #+RESULTS: vector southpole
 |                 1 |
 | 3.141592653589793 |
 |                 0 |

 ...or hit the equator in the east
 #+name: vector equator east test
 #+BEGIN_SRC octave
   v = vector([0, 1, 0]', 'cartesian');
   get(v, 'spherical')
 #+END_SRC

 #+RESULTS: vector equator east test
 |                 1 |
 | 1.570796326794897 |
 | 1.570796326794897 |

 ...or, where is Africa?
 #+name: vector africa test
 #+BEGIN_SRC octave
   v = vector([1, 0, 0]', 'cartesian');
   get(v, 'spherical')
 #+END_SRC

 #+RESULTS: vector africa test
 |                 1 |
 | 1.570796326794897 |
 |                 0 |

 #+name: vector multi dim get test
 #+BEGIN_SRC octave
   v = vector(rand(3, 3, 5, 6), 'polar');
   ans = size(get(v, 'cartesian'));
 #+END_SRC

 #+RESULTS: vector multi dim get test
 | 3 | 3 | 5 | 6 |

**** Tests                                                         :internal:
 #+name: vector set test
 #+BEGIN_SRC octave
   v = vector([0, 0, -1]', 'cartesian');
   v = set(v, [0, 0, 1], 'spherical');
   ans = get(v, 'spherical')';
 #+END_SRC

 #+RESULTS: vector set test
 | 0 | 0 | 1 |

 Evoke an error message
 #+name: vector set error test
 #+BEGIN_SRC octave 
   v = vector([0, 0, -1]', 'cartesian');
   try
     v = set(v, ones(3, 2), 'spherical');
   catch
     if (strfind(lasterror.message, "set:"))
       S_res = sprintf('set error detected:: %s', lasterror.message);
     else
       S_res = 'no set error detected.';
     endif
   end_try_catch
   ans = S_res;
 #+END_SRC

 #+RESULTS: vector set error test
 : set error detected:: set: Number of vectors must no change.

**** Tests                                                         :internal:
 Der Betrag möge 1 werden:
 #+BEGIN_SRC octave
   v = vector([1, 0, -1]', 'cartesian');
   v_abs_no_norm = sqrt(sum(get(v, 'cartesian').^2));
   v_abs_norm = sqrt(sum(get(normalize(v), 'cartesian').^2));
   ans = [v_abs_no_norm, v_abs_norm];
 #+END_SRC

 #+RESULTS:
 | 1.414213562373095 | 1 |
**** Examples

 Fall: 1 Vektor, 1 Scalar, 1 Wort ;)
 #+BEGIN_SRC octave
   v = vector([1, 0, -1]', 'cartesian');
   s = 2;
   v = scale(s, v);
   ans = get(v, 'cartesian')';
 #+END_SRC

 #+RESULTS:
 | 2 | 0 | -2 |

*** Tests                                                          :internal:
    
Define a vector grid with 3 dimensions:
#+name: vectorgrid3
#+BEGIN_SRC octave :results none
  x = linspace(1, 10, 100); y = x(1:3); z = x; S_type = 'cartesian';
  g = vectorgrid(x, y, z, S_type);
#+END_SRC

Is it an object?
#+name: vectorgrid3 test
#+BEGIN_SRC octave :tangle vector_test.m
  <<vectorgrid3>>
  ans = isa(g, 'vectorgrid');
#+END_SRC

#+RESULTS:
: 1

Define a 2-dimensional vectorgrid:
#+name: vectorgrid2
#+BEGIN_SRC octave :results none
  x = linspace(1, 10, 100); y = x(1:3); S_type = 'cartesian';
  g = vectorgrid(x, y, S_type);
#+END_SRC

Is it an object?
#+name: vectorgrid2 test
#+BEGIN_SRC octave :tangle vector_test.m
  <<vectorgrid2>>
  ans = isa(g, 'vectorgrid');
#+END_SRC

#+RESULTS: vectorgrid2 test
: 1

***** TODO 2D
We look at some axes like
#+name: vectorgrid example x_A y_B
#+BEGIN_SRC octave
  A = 20; B = 30;
  x_A = linspace(-3, 3, A);
  y_B = linspace(-2, 2, B);
#+END_SRC

A 2D vectorgrid is created via
#+name: vectorgrid example vg_AB 
#+BEGIN_SRC octave
vg_AB = vectorgrid(x_A, y_B, 'cartesian');
#+END_SRC

So, we have got
#+BEGIN_SRC octave :exports results :results output
<<vectorgrid example x_A y_B>>
<<vectorgrid example vg_AB>>
whos x_A y_B vg_AB
#+END_SRC

#+RESULTS:
#+begin_example
Variables in the current scope:

   Attr Name        Size                     Bytes  Class
   ==== ====        ====                     =====  ===== 
        x_A         1x20                       160  double
        y_B         1x30                       240  double
        vg_AB      20x30                       417  vectorgrid

Total is 51 elements using 817 bytes

#+end_example

***** 3D
We look at some axes like
#+name: vectorgrid example x_A y_B z_C
#+BEGIN_SRC octave
  A = 20; B = 30; C = 40;
  x_A = linspace(-3, 3, A);
  y_B = linspace(-2, 2, B);
  z_C = linspace(-4, 4, C);
#+END_SRC

A 3D vectorgrid is created via
#+name: vectorgrid example vg_ABC 
#+BEGIN_SRC octave
vg_ABC = vectorgrid(x_A, y_B, z_C, 'cartesian');
#+END_SRC

So, we have got
#+BEGIN_SRC octave :exports results :results output
<<vectorgrid example x_A y_B z_C>>
<<vectorgrid example vg_ABC>>
whos x_A y_B z_C vg_ABC
#+END_SRC

#+RESULTS:
#+begin_example
Variables in the current scope:

   Attr Name        Size                     Bytes  Class
   ==== ====        ====                     =====  ===== 
        x_A         1x20                       160  double
        y_B         1x30                       240  double
        z_C         1x40                       320  double
        vg_ABC     20x30x40                    737  vectorgrid

Total is 91 elements using 1457 bytes

#+end_example

**** Test                                                          :internal:
Damit erhält man
#+name: vectorgrid size test
#+BEGIN_SRC octave :results raw
  x = linspace(0,10, 194); y = x; z = x; S_type = 'cartesian';
  g = vectorgrid(x, y(1:5), z(1:2), S_type);
  Dim_g =  size(g);
  ans = Dim_g;
#+END_SRC

#+RESULTS: vectorgrid size test
| 194 | 5 | 2 |
**** Examples
#+name: vectorgrid size example 
#+BEGIN_SRC octave :results output :exports both
  x = linspace(0,10, 194); y = x; z = x; S_type = 'cartesian';
  g = vectorgrid(x, y(1:5), z(1:2), S_type);
  Dim_g =  size(g)
#+END_SRC

#+RESULTS: vectorgrid size example
| 194 | 5 | 2 |

**** Example
#+name: display vectorgrid test 
#+BEGIN_SRC octave :results output :exports both
<<vectorgrid2>>
display(g);
#+END_SRC

#+RESULTS: display vectorgrid test
: Vectorgrid g contains 2 axes.
: The coordinate type is cartesian.
: The size is
:    100     3

***** 2D
...das ergibt:
#+name: vectorgrid get test
#+BEGIN_SRC octave 
  g = vectorgrid([4,2,3,3],[3,5], 'cartesian');
  [n2_42, S_type] = get(g);
  % whos
  ans = size(n2_42);
#+END_SRC

#+RESULTS: vectorgrid get test
| 2 | 4 | 2 |

und das kommt nun in den Vektor rein.

#+name: vectorgrid get vector test
#+BEGIN_SRC octave :results output
  g = vectorgrid([2,3],[3,5],[5,6], 'cartesian');
  [n3_222, S_type] = get(g);
  v = vector(n3_222, S_type);
  size(v)
#+END_SRC

#+RESULTS: vectorgrid get vector test
: ans =
: 
:    2   2   2
: 

Es lässt sich auch ein "reshape" der Ausgangsdaten miterledigen
#+name: vectorgrid get vector reshape test
#+BEGIN_SRC octave :results output
  g = vectorgrid([2,3],[3,5],[5,6], 'cartesian');
  [n3_222, S_type] = get(g, 8);
  whos
#+END_SRC

#+RESULTS: vectorgrid get vector reshape test
#+begin_example
Variables in the current scope:

   Attr Name        Size                     Bytes  Class
   ==== ====        ====                     =====  ===== 
        S_type      1x9                          9  char
        ans         1x1                          8  double
        g           2x2x2                       65  vectorgrid
        n3_222      3x8                        192  double

Total is 35 elements using 274 bytes

#+end_example

**** Examples
#+name: vectorgrid reshape test
#+BEGIN_SRC octave :results output
  g = vectorgrid([2,3],[3,5],[5,6], 'cartesian');
  [n, S_type] = get(g, [1, 8]);
  whos
#+END_SRC

#+RESULTS: vectorgrid reshape test
#+begin_example
Variables in the current scope:

   Attr Name        Size                     Bytes  Class
   ==== ====        ====                     =====  ===== 
        S_type      1x9                          9  char
        ans         1x1                          8  double
        g           2x2x2                       65  vectorgrid
        n           3x1x8                      192  double

Total is 35 elements using 274 bytes

#+end_example

***** 3D
Test dimensions of output
#+name: vectorgrid mesgrid default test
#+begin_src octave :results output
  A = 21; B = 30; C = 3;
  g_ABC = vectorgrid(linspace(-3, 3, A), linspace(-2, 2, B), linspace(0, 1, C), 'cartesian');
  [X_BAC, Y_BAC, Z_BAC] = meshgrid(g_ABC);
  size(X_BAC)
#+END_SRC

#+RESULTS: vectorgrid mesgrid default test

...ein Matlab-Meshgrid mit entsprechend vielen (hier 3)
Dimensionen. Der Wertebereich lässt sich einschränken, indem die
Indexbereich gesetzt werden. Dann können aber Dimensionen mit nur
einem Beitrag entstehen, die für die weitere Verwendung mit
Matlab/Octave-surface mit Squeeze entfernt werden müssen.

#+name: vectorgrid mesgrid slice test
#+begin_src octave :results output
  g_CAB = vectorgrid([0,1,2,3], [1,2,3,4], [5,6], 'spherical');
  [X_ACB, Y_ACB, Z_ACB] = meshgrid(g_CAB(:, :, 1));
  size(X_ACB)
#+END_SRC

#+RESULTS: vectorgrid mesgrid slice test
: ans =
: 
:    4   4
: 
*Man beachte*, das die Dimensionen der Ausgangsmatrix entsprechend
Matlab-Konvention getauscht werden.

Bei 3D-meshgrids sollen toolbox und matlab/octave das gleiche Ergebnis
bringen:
#+BEGIN_SRC octave :results output
  % matlab meshgrid
    A = 1; B = 2; C = 3;
    x_A = linspace(0, 1, A);
    y_B = linspace(2, 3, B);
    z_C = linspace(4, 5, C);
    [x_BAC, y_BAC, z_BAC] = meshgrid(x_A, y_B, z_C);

    g_ABC = vectorgrid(x_A, y_B, z_C, 'cartesian');
    [gx_BAC, gy_BAC, gz_BAC] = meshgrid(g_ABC);

    z_BAC
    gz_BAC

#+END_SRC

#+RESULTS:
#+begin_example
z_BAC =

ans(:,:,1) =

   4
   4

ans(:,:,2) =

   4.5000
   4.5000

ans(:,:,3) =

   5
   5

gz_BAC =

ans(:,:,1) =

   4
   4

ans(:,:,2) =

   4.5000
   4.5000

ans(:,:,3) =

   5
   5

#+end_example

***** 3D

We could take the vectorgrid example as given by
#+BEGIN_SRC octave
<<vectorgrid example x_A y_B z_C>>
<<vectorgrid example vg_ABC>>
#+END_SRC
and convert is to a meshgrid like this:
#+name: meshgrid from vectorgrid X_BAC Y_BAC Z_BAC 
#+BEGIN_SRC octave
[X_BAC, Y_BAC, Z_BAC] = meshgrid(vg_ABC);
#+END_SRC
The size of the output matrixes is
#+BEGIN_SRC octave :results output :exports results
<<vectorgrid example x_A y_B z_C>>
<<vectorgrid example vg_ABC>>
<<meshgrid from vectorgrid X_BAC Y_BAC Z_BAC>> 
size(X_BAC)
#+END_SRC

#+RESULTS:
: ans =
: 
:    30   20   40
: 
dimensions have changed due to the Octave/Matlab conventions.

**** Example
Let us look for a portion of a vectorgrid as follows:
 #+BEGIN_SRC octave :results output :exports both
   %<<vectorgrid>>
   x = linspace(0,10, 99); y = x; z = x; S_type = 'cartesian';
   g = vectorgrid(x, y, z, S_type);
   display(g(1:3,2,:));
 #+END_SRC

 #+RESULTS:
 : Vectorgrid  contains 3 axes.
 : The coordinate type is cartesian.
 : The size is
 :     3    1   99
 : 

To get the vector information from the vectorgrid, you need to use =vector=:
 #+BEGIN_SRC octave :results output :exports both
 g = vectorgrid([1,2,3], [4,5], [6,7], 'cartesian');
 x_xyz_XYZ = get(vector(g(3,:,:)), 'cartesian')
 #+END_SRC

 #+RESULTS:
 #+begin_example
 x_xyz_XYZ =

 ans(:,:,1,1) =

    3
    4
    6

 ans(:,:,2,1) =

    3
    5
    6

 ans(:,:,1,2) =

    3
    4
    7

 ans(:,:,2,2) =

    3
    5
    7


 #+end_example

**** Test: draw a dependend surface on plain
#+name: booast surface 3
#+BEGIN_SRC octave :results file  :var S_file="img/booast_surface3.png" :tangle booast_surface_3_test.m
<<coordinate system S_type>>
<<g_ABC <- S_type>>
<<g_slice <- g_ABC>>
<<s_slice <- g_slice>>

figure(1); clf;

    %% visualise using matlab
    subplot(1, 2, 1);
    [x, y, z] = meshgrid(g_slice);
    x = squeeze(x);
    y = squeeze(y);
    z = squeeze(z);
    slice_size = size(g_slice);
    switch S_type
      case 'cartesian'
	if slice_size(1) == 1
	  x = x + s_slice;
	elseif slice_size(2) == 1
	  y = y + s_slice;
	elseif slice_size(3) == 1
	  z = z + s_slice;
	end
      case 'spherical'
	%% get surface of grid
	%% create surface as defnd. by s_slice
	if slice_size(1) == 1
	  x = x .* s_slice;
	  y = y .* s_slice;
	  z = z .* s_slice;
	elseif slice_size(2) == 1
	  disp('not implemented yet.');
	elseif slice_size(3) == 1
	  disp('not implemented yet.');
	end
      otherwise
    end
    c = 0*z;
    surface(x, y, z, c);
    xlabel('x'); ylabel('y'); zlabel('z');
    view(30,40);

    %% visualise using toolbox
    subplot(1, 2, 2);
    c_slice = 0 * s_slice;
    surface(g_slice, s_slice, c_slice, 'dependendSurface');
    xlabel('x'); ylabel('y'); zlabel('z');
    view(30,40);
  
<<save S_file>>
#+END_SRC

#+RESULTS: booast surface 3



#+name: test coordinate types in grid spherical
#+BEGIN_SRC octave
    %% create a spherical grid
    C = 50;  r_C     = linspace(1, 10,   C); % m
    A = 50;  theta_A = linspace(pi/10, pi, A); 
    B = 50;  phi_B   = linspace(0, 1.5*pi, B);
    g_CAB = vectorgrid(r_C, theta_A, phi_B, 'spherical');

    %% slice a surface
    s = 1;
    g_slice_CAB = g_CAB(s, :, :);

  %  s_CAB = ones(C, A, B);
  %  s_CAB = reshape(linspace(0, 1, C*A*B), [C, A, B]);

    %% some function
    [x_ACB, y_ACB, z_ACB] = meshgrid(g_slice_CAB);

    %% invent a function on that grid
    s_ACB = 0.1*rand(A, C, B)+1;

    x_AB = squeeze(x_ACB);
    y_AB = squeeze(y_ACB);
    z_AB = squeeze(z_ACB);
    s_AB = squeeze(s_ACB(:,s, :));


    %% draw
    figure(1); clf;
    surface(s_AB .* x_AB, s_AB .* y_AB, s_AB .* z_AB);
    view([30, 40]);
    axis('equal');
    grid('on');
#+END_SRC

#+RESULTS: test coordinate types in grid spherical
: 0

** COMMENT org setup

#+name: org setup
#+BEGIN_SRC emacs-lisp
(org-babel-lob-ingest "octavetemplates.org")
#+END_SRC

#+RESULTS: org setup
: 2

